package day3;

public class Day3 {
    // Найти площадь и периметр прямоугольника
    // Найти площадь и периметр куба
    // Найти количество зёрен на шахматной доске,
    // если на первую клетку положить одно зёрнышко,
    //
    //
   // int firstSide
    //int secondSide
    int customerRectangleSideUno = 15;
    int customerRectangleSideDosno = 25;
    // findRectangleSquare(customerRectangleSideUno, customerRectangleSideDos)
//}
private static void findRectangleSquare (int СторонаНомерОдин, int сторонаНомерДва) {
    //System.out.println ("Wenn wir die erste ")
        }

        //pirivate static void findRectangleSquare (int СторонаНомерОдин, int сторонаНомерДва) {

        }
        // privat static void findSquareCube
